Repository: enz/pentobi
Catalog: pentobi_thumbnailer/po/*.po
Languages: es

# _
source: translator-credits
es: traductor-créditos

source: Pentobi Command Reference
es: Referencia de comandos de Pentobi

source: thumbnailer for game records for the board game Blokus as used by the program Pentobi
es: miniaturizador para registros de partidas para el juego de mesa Blokus según su uso por parte del programa Pentobi

source: Description
es: Descripción

source: <_:command-1/> is part of the program Pentobi and intended to be used as a thumbnailer for the Gnome desktop environment to generate previews of game files written by Pentobi.
es: <_:command-1/> es parte del programa Pentobi y sirve como miniaturizador para el entorno de escritorio Gnome para generar vistas previas de los archivos de partida escritos por Pentobi.

source: The input file is a game file in Pentobi's SGF format as documented in Pentobi-SGF.md in the Pentobi source package. The output file is a thumbnail image. The wanted file format of the image is
es: El archivo de entrada es un archivo de partida en formato SGF de Pentobi tal y como se explica en Pentobi-SGF.md dentro del paquete de origen de Pentobi. El archivo de salida es una imagen en miniatura. El formato de archivo requerido para la imagen es

source: Options
es: Opciones

source: Display help and exit.
es: Mostrar ayuda y salir.

source: The size of the thumbnail. The default is 128.
es: El tamaño de la miniatura. El que viene por defecto es 128.

source: Display version and exit.
es: Mostrar versión y salir.

source: Exit Status
es: Estado de salida

source: 0 if the thumbnail generation succeeds, 1 on error.
es: 0 si la generación de miniaturas tiene éxito; 1 si se produce un error.

source: See Also
es: Consulte también
