Repository: enz/pentobi
Catalog: pentobi/unix/po/*.po
Languages: de, fr, vi

# _
source: translator-credits
de: Markus Enzenberger <enz@users.sourceforge.net>, 2019

source: Pentobi Command Reference
de: Pentobi Befehlsreferenz

source: computer opponent for the board game Blokus
de: Computer-Gegner für das Brettspiel Blokus

source: <_:command-1/> <arg><_:option-2/> <replaceable>n</replaceable></arg> <arg><_:option-3/></arg> <arg><_:option-4/></arg> <arg><_:option-5/></arg> <arg><_:option-6/> <replaceable>n</replaceable></arg> <arg><_:option-7/> <replaceable>n</replaceable></arg> <arg><_:option-8/></arg> <arg><replaceable>file.blksgf</replaceable></arg>
de: <_:command-1/> <arg><_:option-2/> <replaceable>n</replaceable></arg> <arg><_:option-3/></arg> <arg><_:option-4/></arg> <arg><_:option-5/></arg> <arg><_:option-6/> <replaceable>n</replaceable></arg> <arg><_:option-7/> <replaceable>n</replaceable></arg> <arg><_:option-8/></arg> <arg><replaceable>Datei.blksgf</replaceable></arg>

source: Description
de: Beschreibung

source: <_:command-1/> is the command to invoke the program Pentobi, which is a graphical user interface and computer opponent for the board game Blokus.
de: <_:command-1/> ist der Befehl zu Starten des Programms Pentobi, das eine grafische Oberfläche und ein Computer-Gegner für das Brettspiel Blokus ist.

source: The command can take the name of a game file to open at startup as an optional argument. The game file is expected to be in Pentobi's SGF format as documented in Pentobi-SGF.md in the Pentobi source package.
de: Der Befehl kann den Namen einer Spieldatei als optionales Argument haben, die beim Start geöffnet werden soll. Die Spieldatei muss im Pentobi-SGF-Format sein, wie beschrieben in Pentobi-SGF.md im Quelltextpaket von Pentobi.

source: Options
de: Optionen

source: Display help and exit.
de: Hilfe anzeigen und Programm beenden.

source: Set the maximum playing level. Reducing this value reduces the amount of memory used by the search, which can be useful to run Pentobi on systems that have low memory or are too slow to use the highest levels. By default, Pentobi currently allocates up to 2 GB (but not more than a quarter of the physical memory available on the system). Reducing the maximum level to 8 currently reduces this amount by a factor of 3 to 4 and lower maximum levels even more.
de: Setzen der maximalen Spielstufe. Wird dieser Wert verkleinert, verringert sich der Speicherbedarf der Suche, was nützlich sein kann, um Pentobi auf Systemen laufen zu lassen, die wenig Speicher besitzen oder zu langsam für die höchsten Spielstufen sind. Standardmäßig belegt Pentobi bis zu 2 GB (aber nicht mehr als ein Viertel des auf dem System verfügbaren physischen Speichers). Ein Verringern der maximalen Spielstufe auf 8 vermindert gegenwärtig den Speicherbedarf um den Faktor 3 bis 4 und geringere maximale Spielstufen sogar noch mehr.

source: Use a window layout optimized for smartphones and apply some user interface changes that assume that a touchscreen is the main input device. If this option is not used, the default layout depends on the platform. Using this option also changes the default style for GUI elements of QQuickControls 2 to Default if the style is not explicitly set with option <_:option-1/>.
de: Ein Fensterlayout benutzen, das für Smartphones optimiert ist und einige Änderungen der Benutzerpberfläche vornehmen, die annehmen, dass ein Touchscreen als primäres Eingabegerät verwendet wird. Das Benutzen dieser Option ändert auch den voreingestellen Style für Benutzeroberflächenelemente von QQuickControls 2 nach Default, wenn der Style nicht explizit mit der Option <_:option-1/> gesetzt wird.

source: Do not use opening books.
de: Keine Eröffnungsbibliotheken benutzen.

source: Do not delay fast computer moves. By default, the computer player adds a small delay if the move generation took less than a second to make it easier for the human to follow the game if the computer plays several moves in a row.
de: Computer-Züge nicht verzögern. Voreingestellt ist, dass der Computer-Spieler Züge ein wenig verzögert, die schneller als innerhalb einer Sekunde generiert werden, um es dem Benutzer leichter zu machen, dem Spiel zu folgen, wenn der Computer mehrere Züge nacheinander generiert.

source: Set the seed for the random generator. Using a fixed seed makes the move generation deterministic if no multi-threading is used (see option <_:option-1/>).
de: Setzt die Seed für den Zufallszahlengenerator. Eine feste Seed macht die Zuggenerierung deterministisch, falls kein Multi-Threading verwendet wird (sihen Option <_:option-1/>).

source: The number of threads to use in the search. By default, up to 8 threads are used in the search depending on the number of hardware threads supported by the current system. Using more threads will speed up the move generation but using a very high number of threads (e.g. more than 8) can degrade the playing strength in higher playing levels.
de: Die Anzahl der Threads, die bei der Suche verwendet werden. Voreingestellt ist, dass die Suche bis zu 8 Threads verwendet, abhängig von Anzahl der auf dem System verfügbaren Hardware-Threads. Mehr Threads machen die Suche schneller, aber eine sehr hohen Anzahl (z. B. mehr als 8) kann die Spielstärke in höheren Spielstufen beeinträchtigen.

source: Print internal information about the move generation and other debugging information to standard error.
de: Interne Informationen zur Zuggenerierung und andere Debugging-Informationen auf dem Standard-Error-Stream ausgeben.

source: Standard Qt Options
de: Standardoptionen von Qt

source: Additionally, any options supported by Qt applications can be used, such as:
de: Zusätzlich können Optionen verwendet werden, die von Qt-Anwendungen unterstützt werden, wie zum Beispiel:

source: Switches displays on X11.
de: Schaltet unter X11 das Anzeigegerät um.

source: Window geometry using the X11 syntax.
de: Fenstergeometrie in X11-Syntax.

source: Set the style for the GUI elements of QQuickControls.
de: Setzen des Style für Benutzeroberflächenelemente von QtQuickControls.

source: Display version and exit.
de: Hilfe anzeigen und Programm beenden.

source: See Also
de: Siehe auch

source: Computer opponent for the board game Blokus
de: Computer-Gegner für das Brettspiel Blokus

source: Pentobi is a computer opponent for the board game Blokus. It has a strong Blokus engine with different playing levels. The supported game variants are Classic, Duo, Trigon, Junior, Nexos, Callisto and GembloQ.
de: Pentobi ist ein Computer-Gegner für das Brettspiel Blokus. Es hat eine spielstarke Blokus-Engine mit verschiedenen Spielstufen. Die unterstützten Spielvarianten sind : Klassisch, Duo, Trigon, Junior, Nexos, Callisto und GembloQ.
fr: Pentobi est un adversaire informatique pour jouer à Blokus. Il dispose d'un moteur de jeu puissant avec différents niveaux de difficulté. Les variantes de jeu prises en charge sont : Classic, Duo, Trigon, Junior, Nexos, Callisto et GembloQ.
vi: Pentobi là đối thủ máy tính cho trò chơi bàn cờ Blokus. Chương trình có engine Blokus mạnh với nhiều cấp độ chơi khác nhau. Các biến thể được hỗ trợ: Classic, Duo, Trigon, Junior, Nexos, Callisto và GembloQ.

source: Players can determine their strength by playing rated games against the computer and use a game analysis function. Games can be saved in Smart Game Format with comments and move variations.
de: Spieler können ihre Spielstärke ermitteln, indem sie gewertete Spiele gegen den Computer spielen, und eine Spielanalysefunktion benutzen. Spiele können im Smart-Game-Format gespeichert werden mit Kommentaren und Zugvarianten.
fr: Les joueurs peuvent évaluer leur niveau en jouant des parties classées contre l'ordinateur et utiliser la fonction d'analyse de jeu. Les parties peuvent être sauvegardées au format Smart Game Format avec des commentaires et des variations de coups.
vi: Người chơi có thể xác định trình độ qua các ván tính elo với máy và dùng chức năng phân tích ván cờ. Ván cờ có thể lưu dưới định dạng Smart Game Format kèm bình luận và các biến thể nước đi.

source: System requirements: 1 GB RAM, 1 GHz CPU (4 GB RAM, 2.5 GHz dual-core or faster CPU recommended for playing level 9).
de: Systemminima: 1 GB RAM, 1 GHz CPU (4 GB RAM, 2,5 GHz Dual-Core- oder schnellere CPU empfohlen für Spielstufe 9).

source: Trademark disclaimer: The trademark Blokus and other trademarks referred to are property of their respective trademark holders. The trademark holders are not affiliated with the author of the program Pentobi.
de: Hinweis zu Markennamen: Der Markenname Blokus und andere erwähnte Marken sind Eigentum ihrer jeweiligen Markeninhaber. Die Markeninhaber stehen in keiner Verbindung mit dem Autor des Programms Pentobi.
fr: Avertissement concernant les marques déposées : La marque Blokus et les autres marques mentionnées sont la propriété de leurs détenteurs respectifs. Les détenteurs de ces marques ne sont pas affiliés à l'auteur du programme Pentobi.
vi: Tuyên bố miễn trừ trách nhiệm nhãn hiệu: Nhãn hiệu Blokus và các nhãn hiệu khác được đề cập thuộc sở hữu của chủ sở hữu tương ứng. Các chủ sở hữu nhãn hiệu không có liên kết với tác giả chương trình Pentobi.

source: Game variant Classic
de: Spielvariante Klassisch
fr: Variant de jeu Classique
vi: Biến thể Classic

source: Game variant Duo
de: Spielvariante Duo
fr: Variant de jeu Duo
vi: Biến thể Duo

source: Game variant Trigon
de: Spielvariante Trigon
fr: Variant de jeu Trigon
vi: Biến thể Trigon

source: Game variant Nexos
de: Spielvariante Nexos
fr: Variant de jeu Nexos
vi: Biến thể Nexos

source: Game variant GembloQ
de: Spielvariante GembloQ
fr: Variant de jeu GembloQ
vi: Biến thể GembloQ

source: Computer opponent for Blokus
de: Computer-Gegner für Blokus
fr: Adversaire informatique pour jouer à Blokus
vi: Đối thủ máy tính cho trò chơi Blokus

source: Blokus game
de: Blokus-Partie
fr: Partie de Blokus
vi: Trò chơi Blokus

source: Blokus;Blokus Duo;Blokus Trigon;Blokus Junior;Nexos;Callisto;Gemblo Q;GembloQ
vi: Blokus;Blokus Duo;Blokus Trigon;Blokus Junior;Nexos;Callisto;Gemblo Q;GembloQ;blokus;duo;trigon;junior;nexos;callisto;gembloq;trò chơi bàn cờ;polyomino;đối thủ máy tính
