Repository: enz/pentobi
Catalog: pentobi/help/po/*.po
Languages: fr, vi

source: Load a saved game. The board position after loading will be the last position in the main variation unless the game starts with a setup position. If the game starts with a setup, the board position will be the first position instead. This avoids that solutions are immediately shown if the file contains a Blokus puzzle as a setup with the solution as the main variation.
fr: Ouvrir une partie sauvegardée. La position du plateau après le chargement sera la dernière position de la variation principale, sauf si la partie commence par une position de départ. Si la partie commence par une position de départ, la position du plateau sera la première position à la place. Cela évite que des solutions soient immédiatement affichées si le fichier contient un puzzle Blokus avec la solution comme variation principale.
vi: Mở ván đã lưu. Sau khi mở, vị trí hiển thị sẽ là vị trí cuối của biến thể chính, trừ khi ván bắt đầu bằng thế cờ cài sẵn – lúc đó sẽ hiển thị vị trí đầu tiên để tránh lộ đáp án.

source: <guimenu>Open Recent</guimenu>
fr: <guimenu>Fichiers récents</guimenu>
vi: <guimenu>Mở gần đây</guimenu>

source: Load a recently used game.
fr: Charger une partie récemment utilisée.
vi: Mở một ván đã chơi gần đây.

source: <guimenuitem>Save</guimenuitem>
fr: <guimenuitem>Enregistrer</guimenuitem>
vi: <guimenuitem>Lưu</guimenuitem>

source: Save the current game.
fr: Enregistrer la partie en cours.
vi: Lưu ván hiện tại.

source: <guimenuitem>Save As</guimenuitem>
fr: <guimenuitem>Enregistrer sous</guimenuitem>
vi: <guimenuitem>Lưu thành…</guimenuitem>

source: (<keysym>Ctrl+Shift+S</keysym>)
fr: (<keysym>Ctrl+Maj+S</keysym>)

source: Save the current game under a new file name.
fr: Enregistrer la partie en cours sous un nouveau nom de fichier.
vi: Lưu ván hiện tại với tên tệp mới.

source: <guimenuitem>Export Image</guimenuitem>
fr: <guimenuitem>Exporter une image</guimenuitem>
vi: <guimenuitem>Xuất ảnh</guimenuitem>

source: Save the current position as an image file. Several image file formats are supported, the file format is derived from the file name ending (e.g. ".png" for the PNG format). For a crisp image, the image width should be an integer multiple of the number of board columns in the current game variant.
fr: Enregistrer la position actuelle sous forme de fichier image. Plusieurs formats de fichiers image sont pris en charge, le format étant dérivé de l'extension du nom du fichier (par exemple, ".png" pour le format PNG). Pour une image nette, la largeur de l'image doit être un multiple entier du nombre de colonnes du plateau dans la variante de jeu actuelle.
vi: Xuất vị trí hiện tại thành tệp ảnh. Hỗ trợ nhiều định dạng ảnh, định dạng được suy ra từ phần mở rộng tên tệp (ví dụ “.png”). Để ảnh sắc nét, chiều rộng ảnh nên là bội số của số cột bảng trong biến thể hiện tại.

source: <guimenuitem>Quit</guimenuitem>
fr: <guimenuitem>Quitter</guimenuitem>
vi: <guimenuitem>Thoát</guimenuitem>

source: Quit Pentobi.
fr: Quitter Pentobi.
vi: Thoát Pentobi.

source: <guimenu>Go</guimenu> Menu
fr: Menu <guimenu>Déplacement</guimenu>
vi: Menu <guimenu>Di chuyển</guimenu>

source: <guimenuitem>Move Number</guimenuitem>
fr: <guimenuitem>Numéro de coup</guimenuitem>
vi: <guimenuitem>Số nước đi</guimenuitem>

source: Go to the move with a given move number in the current variation.
fr: Aller au coup correspondant au numéro de coup donné dans la variation en cours.
vi: Đến nước đi có số thứ tự chỉ định trong biến thể hiện tại.

source: <guimenuitem>Main Variation</guimenuitem>
fr: <guimenuitem>Variation principale</guimenuitem>
vi: <guimenuitem>Biến thể chính</guimenuitem>

source: Go back to the last position in the current variation that belonged to the main variation.
fr: Revenir à la dernière position de la variation en cours qui faisait partie de la variation principale.
vi: Quay lại vị trí cuối cùng trong biến thể hiện tại thuộc về biến thể chính.

source: <guimenuitem>Beginning of Branch</guimenuitem>
fr: Au début de la branche
vi: <guimenuitem>Đầu nhánh</guimenuitem>

source: Go back to the last position in the current variation that had an alternative move.
fr: Revenir à la dernière position de la variation en cours qui avait un coup alternatif.
vi: Quay lại vị trí cuối cùng trong biến thể hiện tại có nước đi thay thế (đầu nhánh).

source: <guimenuitem>Next Comment</guimenuitem>
fr: <guimenuitem>Commentaire suivant</guimenuitem>
vi: <guimenuitem>Bình luận tiếp theo</guimenuitem>

source: Go to the next position that has a comment. If the comment text field was not visible, it will become visible. Selecting this item repeatedly will show all positions with comments in the game tree.
fr: Aller à la position suivante avec un commentaire. Si le champ de texte du commentaire n'était pas visible, il le deviendra. Sélectionner cet élément plusieurs fois affichera toutes les positions avec des commentaires dans l'arbre de jeu.
vi: Đến vị trí tiếp theo có bình luận. Nếu vùng bình luận chưa hiện, nó sẽ hiện ra. Chọn lặp lại sẽ duyệt lần lượt tất cả vị trí có bình luận trong cây ván cờ.

source: <guimenu>Edit</guimenu> Menu
fr: Menu <guimenu>Édition</guimenu>
vi: Menu <guimenu>Chỉnh sửa</guimenu>

source: Add a chess-style annotation symbol (e.g. ‼) to the current move. The symbols are appended to the move numbers in the status bar and, depending on the configuration of <guilabel>Move Marking</guilabel>, on the board.
fr: Ajouter un symbole d'annotation de style échecs (par exemple ‼) au coup en cours. Les symboles sont ajoutés aux numéros de coup dans la barre d'état et, selon la configuration de <guilabel>Marquage des coups</guilabel>, sur le plateau.
vi: Thêm ký hiệu đánh giá kiểu cờ vua (ví dụ ‼) cho nước đi hiện tại. Ký hiệu sẽ hiện sau số nước đi trên thanh trạng thái và (tùy cấu hình <guilabel>Đánh dấu nước đi</guilabel>) trên bảng cờ.

source: <guimenuitem>Make Main Variation</guimenuitem>
fr: <guimenuitem>Choisir comme variation principale</guimenuitem>
vi: <guimenuitem>Đặt làm biến thể chính</guimenuitem>

source: Make the current variation the main variation of the game. This reorders the nodes in the game tree such that the current variation becomes the main variation.
fr: Faire de la variation actuelle la variation principale de la partie. Cela réorganise les nœuds de l'arbre de jeu de sorte que la variation actuelle devienne la variation principale.
vi: Đặt biến thể hiện tại thành biến thể chính. Thao tác này sắp xếp lại các nút trong cây ván cờ để biến thể hiện tại trở thành biến thể chính.

source: <guimenuitem>Variation Up</guimenuitem>
fr: <guimenuitem>Variation vers le haut</guimenuitem>
vi: <guimenuitem>Biến thể lên</guimenuitem>

source: Changes the order of variations such that the current position will appear earlier when iterating over the variations with <guibutton>Next Variation</guibutton> /<guibutton>Previous Variation</guibutton>.
fr: Modifie l'ordre des variations de sorte que la position actuelle apparaisse plus tôt lors de la navigation avec <guibutton>Variation suivante</guibutton> /<guibutton>Variation précédente</guibutton>.
vi: Đưa biến thể hiện tại lên trên để khi duyệt bằng <guibutton>Biến thể tiếp theo</guibutton> / <guibutton>Biến thể trước</guibutton> thì vị trí hiện tại xuất hiện sớm hơn.

source: <guimenuitem>Variation Down</guimenuitem>
fr: <guimenuitem>Variation vers le bas</guimenuitem>
vi: <guimenuitem>Biến thể xuống</guimenuitem>

source: Changes the order of variations such that the current position will appear later when iterating over the variations with <guibutton>Next Variation</guibutton> /<guibutton>Previous Variation</guibutton>.
fr: Modifie l'ordre des variations de sorte que la position actuelle apparaisse plus tard lors de la navigation avec <guibutton>Variation suivante</guibutton> /<guibutton>Variation précédente</guibutton>.
vi: Đưa biến thể hiện tại xuống dưới để khi duyệt bằng <guibutton>Biến thể tiếp theo</guibutton> / <guibutton>Biến thể trước</guibutton> thì vị trí hiện tại xuất hiện muộn hơn.

source: <guimenuitem>Delete Variations</guimenuitem>
fr: <guimenuitem>Détruire les variations</guimenuitem>
vi: <guimenuitem>Xóa các biến thể</guimenuitem>

source: Delete all variations but the main variation. If the current position is not in the main variation, it will first be changed to a position as in <guimenu>Go</guimenu> / <guimenuitem>Main Variation</guimenuitem>.
fr: Supprimer toutes les variations sauf la variation principale. Si la position actuelle ne fait pas partie de la variation principale, elle sera d'abord modifiée pour correspondre à une position de la variation principale (comme dans <guimenu>Déplacement</guimenu> / <guimenuitem>Variation principale</guimenuitem>).
vi: Xóa tất cả biến thể trừ biến thể chính. Nếu vị trí hiện tại không thuộc biến thể chính, chương trình sẽ tự chuyển về biến thể chính trước khi xóa.

source: <guimenuitem>Truncate</guimenuitem>
fr: <guimenuitem>Couper</guimenuitem>
vi: <guimenuitem>Cắt ngắn</guimenuitem>

source: Remove the node with the current position, including any subtree, from the game tree.
fr: Supprimer le nœud avec la position actuelle, ainsi que tout son sous-arbre, de l'arbre de jeu.
vi: Xóa nút vị trí hiện tại cùng toàn bộ cây con khỏi cây ván cờ.

source: <guimenuitem>Truncate Children</guimenuitem>
fr: <guimenuitem>Couper les branches filles</guimenuitem>
vi: <guimenuitem>Xóa các nhánh con</guimenuitem>

source: Remove all child nodes of the node with the current position from the game tree.
fr: Supprimer tous les nœuds enfants du nœud avec la position actuelle de l'arbre de jeu.
vi: Xóa tất cả nút con của vị trí hiện tại khỏi cây ván cờ.

source: <guimenuitem>Keep Position</guimenuitem>
fr: <guimenuitem>Garder la position</guimenuitem>
vi: <guimenuitem>Giữ lại vị trí</guimenuitem>

source: Delete all moves and keep only the current position as a setup. This can be used to create files that start with a given fixed position.
fr: Supprimer tous les coups et garder uniquement la position actuelle comme position de départ. Cela peut être utilisé pour créer des fichiers qui commencent avec une position fixe donnée.
vi: Xóa toàn bộ nước đi, chỉ giữ lại vị trí hiện tại làm thế cờ khởi đầu. Dùng để tạo tệp bắt đầu bằng một thế cờ cố định.

source: <guimenuitem>Keep Subtree</guimenuitem>
fr: <guimenuitem>Garder le sous-arbre</guimenuitem>
vi: <guimenuitem>Giữ lại cây con</guimenuitem>

source: Like <guimenuitem>Keep Position</guimenuitem> but does not delete the moves after the current position.
fr: Comme <guimenuitem>Garder la position</guimenuitem>, mais ne supprime pas les coups après la position actuelle.
vi: Giống <guimenuitem>Giữ lại vị trí</guimenuitem> nhưng giữ nguyên các nước đi sau vị trí hiện tại.

source: <guimenuitem>Setup Mode</guimenuitem>
fr: <guimenuitem>Position</guimenuitem>
vi: <guimenuitem>Chế độ cài đặt thế cờ</guimenuitem>

source: Enter or leave setup mode. In setup mode, pieces can be placed anywhere on the board, even in violation of the game rules. Existing pieces can be removed from the board by clicking on them. The currently selected color also determines the color to play after the setup is finished. It can be changed with <guimenuitem>Next Color</guimenuitem> or by clicking on the orientation selector while no piece is selected. Setup mode can only be used if no moves have been played yet.
fr: Entrer ou quitter le mode de configuration. En mode de configuration, les pièces peuvent être placées n'importe où sur le plateau, même en violation des règles du jeu. Les pièces existantes peuvent être supprimées du plateau en cliquant dessus. La couleur actuellement sélectionnée détermine également la couleur à jouer après la fin de la configuration. Elle peut être changée avec <guimenuitem>Couleur suivante</guimenuitem> ou en cliquant sur le sélecteur d'orientation lorsqu'aucune pièce n'est sélectionnée. Le mode de configuration ne peut être utilisé que si aucun coup n'a encore été joué.
vi: Bật/tắt chế độ cài đặt thế cờ. Trong chế độ này, có thể đặt mảnh bất kỳ đâu (kể cả vi phạm luật) và xóa mảnh bằng cách nhấp vào chúng. Màu đang chọn cũng là màu sẽ đi sau khi kết thúc cài đặt. Có thể đổi màu bằng <guimenuitem>Màu tiếp theo</guimenuitem> hoặc nhấp vào bộ chọn hướng khi không chọn mảnh. Chỉ dùng được khi chưa có nước đi nào.

source: <guimenuitem>Next Color</guimenuitem>
fr: <guimenuitem>Couleur suivante</guimenuitem>
vi: <guimenuitem>Màu tiếp theo</guimenuitem>

source: Choose the next color for selecting pieces. This can be used for example to enter game records, in which moves of a color were skipped because the color ran out of time.
fr: Choisir la couleur suivante pour sélectionner les pièces. Cela peut être utilisé, par exemple, pour entrer des records de parties, dans lesquels les coups d'une couleur ont été ignorés parce que cette couleur a manqué de temps.
vi: Chọn màu tiếp theo để đặt mảnh. Dùng khi nhập biên bản ván cờ mà có màu bị bỏ lượt (ví dụ hết giờ).

source: <guimenu>View</guimenu> Menu
fr: Menu <guimenu>Affichage</guimenu>
vi: Menu <guimenu>Xem</guimenu>

source: <guimenuitem>Appearance</guimenuitem>
fr: <guimenuitem>Apparence</guimenuitem>
vi: <guimenuitem>Giao diện</guimenuitem>

source: <guilabel>Coordinates</guilabel>
fr: <guilabel>Coordonnées</guilabel>
vi: <guilabel>Hiển thị tọa độ</guilabel>

source: Display coordinates around the board for the fields on the board. The convention for the coordinates is the same as in the Blokus SGF file format used by Pentobi.
fr: Afficher les coordonnées autour du plateau pour les cases. La convention des coordonnées est la même que celle utilisée dans le format de fichier SGF Blokus utilisé par Pentobi.
vi: Hiển thị tọa độ quanh bảng cờ. Quy ước tọa độ giống định dạng tệp SGF Blokus mà Pentobi dùng.

source: <guilabel>Show variations</guilabel>
fr: <guilabel>Afficher les variations</guilabel>
vi: <guilabel>Hiển thị biến thể</guilabel>

source: Appends a letter to the move number on the board if the move has variations. If moves are marked with dots instead of numbers, a circle will be used instead of a dot for moves not in the main variation.
fr: Ajoute une lettre au numéro du coup sur le plateau si le coup a des variations. Si les coups sont marqués par des points au lieu de numéros, un cercle sera utilisé à la place du point pour les coups qui ne font pas partie de la variation principale.
vi: Thêm chữ cái sau số nước đi trên bảng nếu nước đó có biến thể. Nếu dùng chấm thay số, nước không thuộc biến thể chính sẽ dùng vòng tròn thay vì chấm.

source: <guilabel>Move number</guilabel>
fr: <guilabel>Numéro de coup</guilabel>
vi: <guilabel>Số nước đi</guilabel>

source: This option exists only in desktop mode and shows the move number, move annotation and variation information at the right side of the status bar.
fr: Cette option existe uniquement en mode bureau et affiche le numéro du coup, l'annotation du coup et les informations sur les variations du côté droit de la barre d'état.
vi: Chỉ có trên chế độ desktop, hiển thị số nước đi, ghi chú và thông tin biến thể ở bên phải thanh trạng thái.

source: <guilabel>Colorblind mode</guilabel>
fr: <guilabel>Mode daltonien</guilabel>
vi: <guilabel>Chế độ mù màu</guilabel>

source: Use piece colors more distinguishable for colorblind users.
fr: Utilisez des couleurs de pièces plus reconnaissables pour les utilisateurs daltoniens.
vi: Dùng màu mảnh dễ phân biệt hơn cho người mù màu.

source: <guilabel>Move marking</guilabel>
fr: <guilabel>Marquage des coups</guilabel>
vi: <guilabel>Đánh dấu nước đi</guilabel>

source: Change the way moves are marked on the board. The options are to mark the last move played with a dot or with a number, or to show the numbers of all moves, or not to show any marks.
fr: Modifie la façon dont les coups sont marqués sur le plateau. Les options sont : marquer le dernier coup joué avec un point ou un numéro, afficher les numéros de tous les coups, ou ne pas afficher de marque.
vi: Thay đổi cách đánh dấu nước đi trên bảng. Có thể: chỉ đánh dấu nước cuối bằng chấm hoặc số, hiển thị số tất cả nước đi, hoặc không đánh dấu.

source: <guilabel>Show comment</guilabel>
fr: <guilabel>Afficher le commentaire</guilabel>
vi: <guilabel>Hiển thị bình luận</guilabel>

source: This option exists only in desktop mode and configures the visibility of the comment area when the position changes. By default, the comment area is only shown if a comment exists for the current position.
fr: Cette option n'existe que en mode bureau et configure la visibilité de la zone de commentaire lorsque la position change. Par défaut, la zone de commentaire n'est affichée que s'il existe un commentaire pour la position actuelle.
vi: Chỉ có trên chế độ desktop, cấu hình việc hiện vùng bình luận khi đổi vị trí. Mặc định chỉ hiện khi vị trí có bình luận.

source: <guimenuitem>Comment</guimenuitem>
fr: <guimenuitem>Commentaire</guimenuitem>
vi: <guimenuitem>Bình luận</guimenuitem>

source: Toggle the visibility of the comment area in the current position.
fr: Alterner la visibilité de la zone de commentaire pour la position actuelle.
vi: Bật/tắt hiển thị vùng bình luận cho vị trí hiện tại.

source: <guimenuitem>Fullscreen</guimenuitem>
fr: <guimenuitem>Plein écran</guimenuitem>
vi: <guimenuitem>Toàn màn hình</guimenuitem>

source: Make the main window full screen or leave full screen mode. To leave fullscreen mode without using the window menu, press the F11 key.
fr: Passer en plein écran ou quitter le mode plein écran. Pour quitter le mode plein écran sans utiliser le menu de la fenêtre, appuyez sur la touche F11.
vi: Chuyển cửa sổ chính sang toàn màn hình hoặc thoát. Để thoát toàn màn hình mà không dùng menu, nhấn phím F11.

source: <guimenu>Computer</guimenu> Menu
fr: Menu <guimenu>Ordinateur</guimenu>
vi: Menu <guimenu>Máy</guimenu>

source: <guimenuitem>Settings</guimenuitem>
fr: <guimenuitem>Configuration</guimenuitem>
vi: <guimenuitem>Cấu hình</guimenuitem>

source: Select which colors are played by the computer and the playing strength for the computer. Higher levels are stronger but can make the computer take a long time for playing moves on slow computers.
fr: Sélectionner les couleurs jouées par l'ordinateur et le niveau de jeu de l'ordinateur. Les niveaux plus élevés sont plus forts, mais peuvent faire prendre plus de temps à l'ordinateur pour jouer sur des ordinateurs plus lents.
vi: Chọn màu máy sẽ chơi và độ mạnh của máy. Cấp độ cao hơn mạnh hơn nhưng có thể lâu đi trên máy tính chậm.

source: <guimenuitem>Play</guimenuitem>
fr: <guimenuitem>Jouer</guimenuitem>
vi: <guimenuitem>Đi</guimenuitem>

source: Make the computer play a move for the current color. This can be used to change the color the computer plays or to resume playing after navigating in the game tree. If the computer did not already play the current color, it will play this color (and only this color) from now on.
fr: Faire jouer un coup à l'ordinateur pour la couleur actuelle. Cela peut être utilisé pour changer la couleur jouée par l'ordinateur ou pour reprendre la partie après avoir navigué dans l'arbre de jeu. Si l'ordinateur n'a pas encore joué cette couleur, il jouera désormais cette couleur (et uniquement cette couleur).
vi: Để máy đi một nước cho màu hiện tại. Dùng để đổi màu máy chơi hoặc tiếp tục chơi sau khi duyệt cây ván cờ. Nếu máy chưa chơi màu này thì từ giờ chỉ chơi màu này.

source: <guimenuitem>Play Move</guimenuitem>
fr: <guimenuitem>Jouer un coup</guimenuitem>
vi: <guimenuitem>Đi một nước</guimenuitem>

source: (<keysym>Ctrl+Shift+L</keysym>)
fr: (<keysym>Ctrl+Maj+L</keysym>)

source: Make the computer play a single move for the current color without changing the colors played by the computer.
fr: Faire jouer un seul coup à l'ordinateur pour la couleur actuelle sans changer les couleurs jouées par l'ordinateur.
vi: Để máy đi một nước duy nhất cho màu hiện tại mà không thay đổi các màu máy đang chơi.

source: <guimenuitem>Stop</guimenuitem>
fr: <guimenuitem>Arrêter</guimenuitem>
vi: <guimenuitem>Dừng</guimenuitem>

source: Abort the current move generation. You can make the computer continue to play by selecting <guimenuitem>Play</guimenuitem>.
fr: Abandonner la génération du coup actuel. Vous pouvez faire continuer l'ordinateur en sélectionnant <guimenuitem>Jouer</guimenuitem>.
vi: Dừng việc tính nước đi hiện tại. Có thể cho máy tiếp tục bằng cách chọn <guimenuitem>Đi</guimenuitem>.

source: <guimenu>Tools</guimenu> Menu
fr: Menu <guimenu>Outils</guimenu>
vi: Menu <guimenu>Công cụ</guimenu>

source: <guimenuitem>Rating</guimenuitem>
fr: <guimenuitem>Classement</guimenuitem>
vi: <guimenuitem>Elo</guimenuitem>

source: Show a dialog window with the <link linkend="rating">rating</link> of the user in the current game variant.
fr: Afficher une fenêtre de dialogue avec le classement de l'utilisateur dans la variante de jeu actuelle.
vi: Hiển thị cửa sổ chứa <link linkend="rating">elo</link> của bạn trong biến thể hiện tại.

source: <guimenuitem>Clear Rating</guimenuitem>
fr: <guimenuitem>Effacer le classement</guimenuitem>
vi: <guimenuitem>Xóa elo</guimenuitem>

source: Deletes the rating information and history for the current game variant.
fr: Supprime les informations de classement et l'historique pour la variante de jeu actuelle.
vi: Xóa toàn bộ thông tin và lịch sử elo của biến thể trò chơi hiện tại.

source: <guimenuitem>Analyze Game</guimenuitem>
fr: <guimenuitem>Analyser la partie</guimenuitem>
vi: <guimenuitem>Phân tích ván cờ</guimenuitem>

source: Perform a <link linkend="analysis">game analysis</link>.
fr: Effectuer une <link linkend="analysis">analyse de la partie</link>.
vi: Thực hiện <link linkend="analysis">phân tích ván cờ</link>.

source: <guimenuitem>Clear Analysis</guimenuitem>
fr: <guimenuitem>Effacer l’analyse</guimenuitem>
vi: <guimenuitem>Xóa phân tích</guimenuitem>

source: Deletes the analysis for the current game.
fr: Supprimer l'analyse de la partie actuelle.
vi: Xóa kết quả phân tích của ván hiện tại.

source: <guimenu>Help</guimenu> Menu
fr: Menu <guimenu>Aide</guimenu>
vi: Menu <guimenu>Trợ giúp</guimenu>

source: <guimenuitem>Pentobi Help</guimenuitem>
fr: <guimenuitem>Aide de Pentobi</guimenuitem>
vi: <guimenuitem>Trợ giúp Pentobi</guimenuitem>

source: Show a window to browse the Pentobi user manual.
fr: Afficher une fenêtre pour parcourir le manuel utilisateur de Pentobi.
vi: Mở cửa sổ xem hướng dẫn sử dụng Pentobi.

source: <guimenuitem>About Pentobi</guimenuitem>
fr: <guimenuitem>À propos de Pentobi</guimenuitem>
vi: <guimenuitem>Giới thiệu Pentobi</guimenuitem>

source: Show an info dialog with information about this version of Pentobi.
fr: Afficher une fenêtre d'information avec des détails sur cette version de Pentobi.
vi: Hiển thị hộp thoại thông tin về phiên bản Pentobi hiện tại.

source: Keyboard Shortcuts
fr: Touches de raccourci
vi: Phím tắt bàn phím

source: In addition to the shortcut keys, which are shown in the window menu, the following shortcut keys are supported by Pentobi. Note that these shortcuts are not active when the comment text field has the focus. In this case, the focus can be switched away from the comment text with the Tab key.
fr: En plus des touches de raccourci, qui sont affichées dans le menu Fenêtre, les touches de raccourci suivantes sont prises en charge par Pentobi. Notez que ces raccourcis ne sont pas actifs lorsque le champ de texte des commentaires a le focus. Dans ce cas, le focus peut être déplacé en dehors du champ de texte des commentaires en appuyant sur la touche Tab.
vi: Ngoài các phím tắt hiển thị trong menu, Pentobi còn hỗ trợ các phím tắt sau. Lưu ý: các phím tắt này không hoạt động khi vùng nhập bình luận đang có tiêu điểm. Dùng phím Tab để chuyển tiêu điểm ra khỏi vùng bình luận.

source: Select next piece
fr: Sélectionner la pièce suivante
vi: Chọn mảnh tiếp theo

source: <keysym>Minus</keysym>
fr: <keysym>Moins</keysym>
vi: <keysym>Dấu trừ</keysym>
