Repository: enz/pentobi
Catalog: pentobi/help/po/*.po
Languages: fr, vi

source: Select previous piece
fr: Sélectionner la pièce précédente
vi: Chọn mảnh trước đó

source: <keysym>Escape</keysym>
fr: <keysym>Échap</keysym>

source: Clear selected piece
fr: Effacer la pièce sélectionnée
vi: Bỏ chọn mảnh

source: <keysym>Left</keysym>
fr: <keysym>Gauche</keysym>
vi: <keysym>Trái</keysym>

source: <keysym>Right</keysym>
fr: <keysym>Droite</keysym>
vi: <keysym>Phải</keysym>

source: <keysym>Up</keysym>
fr: <keysym>Haut</keysym>
vi: <keysym>Lên</keysym>

source: <keysym>Down</keysym>
fr: <keysym>Bas</keysym>
vi: <keysym>Xuống</keysym>

source: <keysym>Shift+Left</keysym>
fr: <keysym>Maj+Gauche</keysym>
vi: <keysym>Shift+Trái</keysym>

source: <keysym>Shift+Right</keysym>
fr: <keysym>Maj+Droite</keysym>
vi: <keysym>Shift+Phải</keysym>

source: <keysym>Shift+Up</keysym>
fr: <keysym>Maj+Haut</keysym>
vi: <keysym>Shift+Lên</keysym>

source: <keysym>Shift+Down</keysym>
fr: <keysym>Maj+Bas</keysym>
vi: <keysym>Shift+Xuống</keysym>

source: Move the selected piece. The Shift key makes the piece move faster.
fr: Déplacer la pièce sélectionnée. La touche Maj permet de déplacer la pièce plus rapidement.
vi: Di chuyển mảnh đang chọn. Giữ Shift để di chuyển nhanh hơn.

source: <keysym>Space</keysym>
fr: <keysym>Espace</keysym>
vi: <keysym>Phím cách</keysym>

source: Next orientation of the selected piece
fr: Orientation suivante de la pièce sélectionnée
vi: Xoay mảnh theo chiều kim đồng hồ

source: <keysym>Shift+Space</keysym>
fr: <keysym>Maj+Espace</keysym>
vi: <keysym>Shift+Phím cách</keysym>

source: Previous orientation of the selected piece
fr: Orientation précédente de la pièce sélectionnée
vi: Xoay mảnh ngược chiều kim đồng hồ

source: <keysym>Enter</keysym>
fr: <keysym>Entrée</keysym>

source: Play the selected piece
fr: Jouer la pièce sélectionnée
vi: Đặt mảnh đang chọn

source: Select piece according to commonly used piece names. If there are multiple pieces with the letter (e.g. I3, I4, I5), pressing the key several times cycles between them. Some letters are used only in certain game variants. For example, A is used only in Trigon for the pieces A6 and A4 (also known as "lobster" and "triangle").
fr: Sélectionner une pièce selon les noms de pièces couramment utilisés. S'il y a plusieurs pièces avec la même lettre (par exemple, I3, I4, I5), appuyer plusieurs fois sur la touche permet de faire défiler les options. Certaines lettres sont utilisées uniquement dans certaines variantes de jeu. Par exemple, A est utilisé uniquement dans Trigon pour les pièces A6 et A4 (également appelées 'homard' et 'triangle').
vi: Chọn mảnh theo tên gọi phổ biến. Nếu có nhiều mảnh cùng chữ cái (ví dụ I3, I4, I5), nhấn liên tục sẽ chuyển vòng giữa chúng. Một số chữ cái chỉ dùng trong một số biến thể, ví dụ chữ A chỉ dùng ở Trigon cho mảnh A6 và A4 (còn gọi là “tôm hùm” và “tam giác”).

source: <keysym>Ctrl+Home</keysym>
fr: <keysym>Ctrl+Début</keysym>

source: <keysym>Ctrl+Shift+Left</keysym>
fr: <keysym>Ctrl+Maj+Gauche</keysym>
vi: <keysym>Ctrl+Shift+Trái</keysym>

source: <keysym>Ctrl+Left</keysym>
fr: <keysym>Ctrl+Gauche</keysym>
vi: <keysym>Ctrl+Trái</keysym>

source: <keysym>Ctrl+Right</keysym>
fr: <keysym>Ctrl+Droite</keysym>
vi: <keysym>Ctrl+Phải</keysym>

source: <keysym>Ctrl+Shift+Right</keysym>
fr: <keysym>Ctrl+Maj+Droite</keysym>
vi: <keysym>Ctrl+Shift+Phải</keysym>

source: <keysym>Ctrl+End</keysym>
fr: <keysym>Ctrl+Fin</keysym>

source: <keysym>Ctrl+Up</keysym>
fr: <keysym>Ctrl+Haut</keysym>
vi: <keysym>Ctrl+Lên</keysym>

source: <keysym>Ctrl+Down</keysym>
fr: <keysym>Ctrl+Bas</keysym>
vi: <keysym>Ctrl+Xuống</keysym>

source: Navigate in the game: beginning, ten moves backward, backward, forward, ten moves forward, end, previous variation, next variation.
fr: Naviguer dans la partie : début, dix coups en arrière, en arrière, en avant, dix coups en avant, fin, variation précédente, variation suivante.
vi: Duyệt ván cờ: đầu ván, lùi 10 nước, lùi 1 nước, tiến 1 nước, tiến 10 nước, cuối ván, biến thể trước, biến thể tiếp theo.

source: <keysym>Ctrl+Shift+H</keysym>
fr: <keysym>Ctrl+Maj+H</keysym>

source: Like <guimenuitem>Find Move</guimenuitem> (Ctrl+H) but iterates backwards through the list of legal moves.
fr: Comme <guimenuitem>Trouver un coup</guimenuitem> (Ctrl+H), mais parcourt la liste des coups légaux en arrière.
vi: Giống <guimenuitem>Tìm nước đi hợp lệ</guimenuitem> (Ctrl+H) nhưng duyệt ngược lại trong danh sách nước đi hợp lệ.

source: Switch view between comment and game analysis.
fr: Alterner la vue entre le commentaire et l'analyse de la partie.
vi: Chuyển đổi hiển thị giữa bình luận và phân tích ván cờ.

source: Open menu.
fr: Ouvrir le menu
vi: Mở menu.

source: <guimenuitem>Annotation</guimenuitem>
vi: <guimenuitem>Ghi chú nước đi</guimenuitem>

source: <keysym>Plus</keysym>
vi: <keysym>Dấu cộng</keysym>
