Repository: enz/pentobi
Catalog: pentobi/help/po/*.po
Languages: fr, vi

source: The score display shows the current points for each color or player. The points are the sum of on-board points and bonus points. Points are underlined if they are final because the color cannot play more pieces. A small star indicates that the points include a bonus.
fr: L'affichage du score montre les points actuels pour chaque couleur ou joueur. Les points sont la somme des points sur le plateau et des points bonus. Les points sont soulignés s'ils sont définitifs, car la couleur ne peut plus jouer d'autres pièces. Une petite étoile indique que les points incluent un bonus.
vi: Bảng điểm hiển thị điểm hiện tại của từng màu/người chơi (tổng điểm ô + điểm thưởng). Điểm được gạch chân khi đã cuối cùng (màu đó không còn nước đi). Dấu sao nhỏ biểu thị có điểm thưởng.

source: Playing Against the Computer
fr: Jouer contre l'ordinateur
vi: Chơi với máy

source: The board can be used for creating game records of games played by humans or for playing games against the computer. In games against the computer, the computer can play any (or several) of the colors.
fr: Le plateau peut être utilisé pour créer des enregistrements de parties jouées par des humains ou pour jouer contre l'ordinateur. Dans les parties contre l'ordinateur, l'ordinateur peut jouer n'importe quelle (ou plusieurs) couleurs.
vi: Bảng có thể dùng để ghi lại ván người đấu người hoặc chơi với máy. Khi chơi với máy, máy có thể đảm nhận bất kỳ màu nào (hoặc nhiều màu).

source: When you start a new game, the human will play the color(s) of the first player by default and the computer all other colors. To change this, use <guimenuitem>Settings</guimenuitem> from the <guimenu>Computer</guimenu> menu or toolbar and select the colors the computer should play.
fr: Lorsque vous commencez une nouvelle partie, l'humain jouera la ou les couleurs du premier joueur par défaut et l'ordinateur jouera toutes les autres couleurs. Pour modifier cela, utilisez <guimenuitem>Configuration</guimenuitem> depuis le menu <guimenu>Ordinateur</guimenu> ou la barre d'outils et sélectionnez les couleurs que l'ordinateur doit jouer.
vi: Khi bắt đầu ván mới, mặc định người chơi điều khiển màu đi đầu, máy chơi các màu còn lại. Để thay đổi, vào menu <guimenu>Computer</guimenu> → <guimenuitem>Settings</guimenuitem> hoặc thanh công cụ để chọn màu máy sẽ chơi.

source: The exception is that the computer will play no color by default if it played no color in the previous game. This prevents the computer from automatically starting to play if the user mainly wants to use the board for entering move sequences or similar editing tasks. After loading a saved game, the computer also plays no color by default.
fr: L'exception est que l'ordinateur ne jouera aucune couleur par défaut s'il n'a joué aucune couleur dans la partie précédente. Cela empêche l'ordinateur de commencer à jouer automatiquement si l'utilisateur souhaite principalement utiliser le plateau pour saisir des séquences de coups ou pour des tâches d'édition similaires. Après avoir chargé une partie sauvegardée, l'ordinateur ne joue également aucune couleur par défaut.
vi: Ngoại lệ: nếu ván trước máy không chơi màu nào thì ván mới máy cũng không tự chơi màu nào, để tránh máy tự động đi khi người dùng chỉ muốn nhập biên bản hoặc chỉnh sửa. Sau khi nạp ván đã lưu, máy cũng mặc định không chơi màu nào.

source: Selecting <guimenuitem>Play</guimenuitem> from the <guimenu>Computer</guimenu> menu or the toolbar always makes the computer play a move for the current color. If the computer did not already play this color before, it will also make the computer play this color (and only this color) from now on.
fr: Sélectionner <guimenuitem>Jouer</guimenuitem> dans le menu <guimenu>Ordinateur</guimenu> ou la barre d'outils fait toujours jouer un coup à l'ordinateur pour la couleur actuelle. Si l'ordinateur n'a pas encore joué cette couleur, il commencera également à jouer cette couleur (et uniquement cette couleur) à partir de maintenant.
vi: Chọn <guimenuitem>Play</guimenuitem> trong menu <guimenu>Computer</guimenu> hoặc thanh công cụ sẽ khiến máy đi một nước cho màu hiện tại. Nếu trước đó máy chưa chơi màu này thì từ giờ máy sẽ chỉ chơi màu này.

source: Move Variations and the Game Tree
fr: Variations de coups et l'arbre de jeu
vi: Biến thể nước đi và cây ván cờ

source: When you play a game, Pentobi will store the sequence of moves and it is always possible to go back to a previous position and play differently. If you do this, the new sequence is stored as an alternative sequence (called variation). Variations can also be used by annotators for commenting on existing games. Variations can exist at any board position and can have subvariations themselves. The game can therefore become a game tree, in which each node represents a board position. You can navigate in the game tree with the items in the <guimenu>Go</guimenu> menu and the navigation buttons.
fr: Lorsque vous jouez une partie, Pentobi enregistre la séquence des coups et il est toujours possible de revenir à une position précédente et de jouer différemment. Si vous faites cela, la nouvelle séquence est enregistrée comme une séquence alternative (appelée variation). Les variations peuvent également être utilisées par les annotateurs pour commenter des parties existantes. Les variations peuvent exister à n'importe quelle position du plateau et peuvent avoir elles-mêmes des sous-variations. La partie peut donc devenir un arbre de jeu, dans lequel chaque nœud représente une position du plateau. Vous pouvez naviguer dans l'arbre de jeu avec les éléments du menu <guimenu>Déplacement</guimenu> et les boutons de navigation.
vi: Khi chơi, Pentobi lưu toàn bộ chuỗi nước đi và luôn có thể quay lại vị trí cũ để đi khác. Chuỗi mới sẽ được lưu dưới dạng biến thể. Biến thể cũng được dùng để bình luận ván cờ. Biến thể có thể tồn tại ở bất kỳ vị trí nào và có biến thể con. Toàn bộ ván cờ vì thế trở thành một cây ván cờ mà mỗi nút là một thế cờ. Bạn có thể di chuyển trong cây ván cờ bằng các mục trong menu <guimenu>Go</guimenu> và các nút điều hướng.

source: The main variation is the sequence of moves that starts at the start position and always selects the first child node in each position (e.g. by pressing the forward button). The main variation is supposed to represent the real game played. If you want a side variation to become the main variation, select <guimenuitem>Make Main Variation</guimenuitem> from the <guimenu>Edit</guimenu> menu.
fr: La variation principale est la séquence de coups qui commence à la position de départ et sélectionne toujours le premier nœud enfant à chaque position (par exemple en appuyant sur le bouton avancer). La variation principale est censée représenter la vraie partie jouée. Si vous souhaitez qu'une variation secondaire devienne la variation principale, sélectionnez <guimenuitem>Choisir comme variation principale</guimenuitem> dans le menu <guimenu>Édition</guimenu>.
vi: Biến thể chính là chuỗi nước đi bắt đầu từ vị trí đầu và luôn chọn nút con đầu tiên tại mỗi vị trí (ví dụ khi nhấn nút tiến). Biến thể chính đại diện cho ván cờ thực tế. Nếu muốn một biến thể phụ trở thành biến thể chính, chọn <guimenuitem>Đặt làm biến thể chính</guimenuitem> trong menu <guimenu>Edit</guimenu>.

source: Become a Stronger Player
fr: Devenir un joueur plus fort
vi: Trở thành người chơi mạnh hơn

source: Pentobi has functionality that can help you to become a stronger Blokus player.
fr: Pentobi dispose de fonctionnalités qui peuvent vous aider à devenir un joueur de Blokus plus fort.
vi: Pentobi có các tính năng giúp bạn nâng cao trình độ chơi Blokus.

source: Game Analysis
fr: Analyse de la partie
vi: Phân tích ván cờ

source: A game can be analyzed by selecting <guimenuitem>Analyze Game</guimenuitem> from the <guimenu>Tools</guimenu> menu. This will make the computer player evaluate each position in the main variation. The result is displayed in a window with a diagram of colored dots.
fr: Une partie peut être analysée en sélectionnant <guimenuitem>Analyser la partie</guimenuitem> dans le menu <guimenu>Outils</guimenu>. Cela fera évaluer chaque position de la variation principale par le joueur ordinateur. Le résultat est affiché dans une fenêtre avec un diagramme de points colorés.
vi: Phân tích ván cờ bằng cách chọn <guimenuitem>Phân tích ván cờ</guimenuitem> trong menu <guimenu>Tools</guimenu>. Máy sẽ đánh giá từng vị trí trong biến thể chính. Kết quả hiển thị trong cửa sổ dạng biểu đồ chấm màu.

source: Each dot represents a game position in which the color of the dot was to play. The dots are ordered horizontally by move number. The vertical axis represents the estimated probability of winning the game for the color to play. Mouse clicks in the diagram will go to the corresponding position.
fr: Chaque point représente une position de jeu dans laquelle la couleur du point devait jouer. Les points sont disposés horizontalement par numéro de coup. L'axe vertical représente la probabilité estimée de gagner la partie pour la couleur qui devait jouer. Les clics de souris sur le diagramme vous amèneront à la position correspondante.
vi: Mỗi chấm biểu diễn một vị trí cờ mà màu của chấm đó đang đến lượt đi. Các chấm sắp xếp ngang theo số nước đi. Trục dọc thể hiện xác suất thắng ước tính của màu đang đi. Nhấp chuột vào biểu đồ sẽ chuyển tới vị trí tương ứng.

source: The position values are only estimates and the computer will sometimes evaluate positions incorrectly. But sudden drops in the value can help you find moves that were potentially bad. You can go back to the position before the move and try to find a better move or ask the computer what it would have played by selecting <guimenuitem>Play Single Move</guimenuitem> from the <guimenu>Computer</guimenu> menu.
fr: Les valeurs de position ne sont que des estimations et l'ordinateur peut parfois évaluer incorrectement certaines positions. Cependant, les chutes soudaines de la valeur peuvent vous aider à repérer des coups potentiellement mauvais. Vous pouvez revenir à la position avant le coup et essayer de trouver un meilleur coup ou demander à l'ordinateur ce qu'il aurait joué en sélectionnant <guimenuitem>Jouer un coup</guimenuitem> dans le menu <guimenu>Ordinateur</guimenu>.
vi: Giá trị vị trí chỉ là ước lượng, máy đôi khi đánh giá sai. Tuy nhiên, sự sụt giảm đột ngột có thể giúp bạn phát hiện nước đi kém. Bạn có thể quay lại trước nước đi đó để tìm nước tốt hơn hoặc chọn <guimenuitem>Đi một nước</guimenuitem> trong menu <guimenu>Computer</guimenu> để xem máy sẽ đi gì.

source: Determine Your Rating
fr: Déterminer votre classement
vi: Xác định elo của bạn

source: You can track your progress by playing rated games against the computer. The game results are used to determine your current rating. The rating is a number that represents your playing strength.
fr: Vous pouvez suivre vos progrès en jouant des parties notées contre l'ordinateur. Les résultats des parties sont utilisés pour déterminer votre classement actuel. Le classement est un nombre qui représente votre niveau de jeu.
vi: Bạn có thể theo dõi tiến bộ bằng cách chơi các ván tính elo với máy. Kết quả ván sẽ được dùng để tính elo hiện tại của bạn – con số thể hiện trình độ chơi.

source: A rated game is started with <guimenuitem>Rated Game</guimenuitem> from the <guimenu>Game</guimenu> menu or the toolbar. If you have not played any rated games in the current game variant, you will be asked to choose a start value, which can reduce the number of games needed for determining your real rating. If you are a beginner, leave the start value at 800.
fr: Une partie classée est lancée en sélectionnant <guimenuitem>Partie classée</guimenuitem> dans le menu <guimenu>Partie</guimenu> ou la barre d'outils. Si vous n'avez joué aucune partie classée dans la variante de jeu actuelle, il vous sera demandé de choisir une valeur de départ, ce qui peut réduire le nombre de parties nécessaires pour déterminer votre véritable classement. Si vous êtes débutant, laissez la valeur de départ à 800.
vi: Bắt đầu ván tính elo bằng <guimenuitem>Ván tính elo</guimenuitem> trong menu <guimenu>Game</guimenu> hoặc thanh công cụ. Nếu bạn chưa chơi ván tính elo nào ở biến thể hiện tại, chương trình sẽ yêu cầu chọn giá trị elo khởi đầu (giúp xác định elo thật nhanh hơn). Nếu bạn mới chơi, để nguyên giá trị 800.

source: For each rated game, the computer will choose a playing level for the computer opponent according to your current rating. The color you play will be randomly chosen in each game.
fr: Pour chaque partie classée, l'ordinateur choisira un niveau de jeu pour l'adversaire informatique en fonction de votre classement actuel. La couleur que vous jouez sera choisie au hasard à chaque partie.
vi: Mỗi ván tính elo, máy sẽ tự chọn cấp độ đối thủ phù hợp với elo hiện tại của bạn. Màu bạn chơi sẽ được chọn ngẫu nhiên mỗi ván.

source: During a rated game, most of the functions not needed for playing are disabled: you cannot undo moves, navigate in the game, change the computer colors or change the playing level. To get an accurate rating, you should always play rated games until the end.
fr: Pendant une partie classée, la plupart des fonctions non nécessaires pour jouer sont désactivées : vous ne pouvez pas annuler les coups, naviguer dans la partie, changer les couleurs de l'ordinateur ou modifier le niveau de jeu. Pour obtenir un classement précis, vous devez toujours jouer les parties classées jusqu'à la fin.
vi: Trong ván tính elo, hầu hết chức năng không cần thiết bị tắt: không được hoàn tác nước đi, duyệt ván, đổi màu máy hoặc đổi cấp độ. Để elo chính xác, luôn chơi hết ván tính elo.

source: After the game has ended, your rating will be updated depending on the game result and the computer level. For the game result, it only matters whether the game was won, lost or a tie. The exact number of score points does not matter.
fr: Une fois la partie terminée, votre classement sera mis à jour en fonction du résultat de la partie et du niveau de l'ordinateur. Pour le résultat de la partie, seul le fait d'avoir gagné, perdu ou fait égalité compte. Le nombre exact de points obtenus n'a pas d'importance.
vi: Sau khi ván kết thúc, elo của bạn sẽ được cập nhật dựa trên kết quả và cấp độ máy. Kết quả chỉ xét thắng–thua–hòa, không xét chênh lệch điểm.

source: You can always see your current rating by selecting <guimenuitem>Rating</guimenuitem> from the <guimenu>Tools</guimenu> menu. This will open a window that shows the development of your rating during the last 50 games as a graph. The last 50 games are automatically saved and can be loaded by opening a context menu in the game table below the graph.
fr: Vous pouvez toujours voir votre classement actuel en sélectionnant <guimenuitem>Classement</guimenuitem> dans le menu <guimenu>Outils</guimenu>. Cela ouvrira une fenêtre affichant l'évolution de votre classement au cours des 50 dernières parties sous forme de graphique. Les 50 dernières parties sont automatiquement enregistrées et peuvent être chargées en ouvrant un menu contextuel dans la table de jeu sous le graphique.
vi: Bạn có thể xem elo hiện tại bất kỳ lúc nào bằng <guimenuitem>Elo</guimenuitem> trong menu <guimenu>Tools</guimenu>. Cửa sổ sẽ hiển thị đồ thị thay đổi elo trong 50 ván gần nhất. 50 ván này được tự động lưu và có thể mở lại bằng menu ngữ cảnh trong bảng ván dưới đồ thị.

source: Window Menu and Toolbar
fr: Menu fenêtre et barre d'outils
vi: Menu và thanh công cụ

source: Navigation Buttons in Toolbar
fr: Boutons de navigation dans la barre d'outils
vi: Các nút điều hướng trên thanh công cụ

source: <guibutton>Beginning</guibutton>
fr: <guibutton>Début</guibutton>
vi: <guibutton>Đầu ván</guibutton>

source: Go to the beginning of the game.
fr: Aller au début de la partie.
vi: Về đầu ván cờ.

source: <guibutton>Backward 10</guibutton>
fr: <guibutton>En arrière de 10</guibutton>
vi: <guibutton>Lùi 10 nước</guibutton>

source: Go ten moves backward in the current variation. The button supports autorepeat if pressed and held.
fr: Revenir de 10 coups en arrière dans la variation actuelle. Le bouton supporte l'auto-répétition lorsqu'il est maintenu enfoncé.
vi: Lùi 10 nước trong biến thể hiện tại. Nút hỗ trợ tự động lặp khi giữ.

source: <guibutton>Backward</guibutton>
fr: <guibutton>En arrière</guibutton>
vi: <guibutton>Lùi</guibutton>

source: Go one move backward in the current variation. The button supports autorepeat if pressed and held.
fr: Revenir d'un coup en arrière dans la variation actuelle. Le bouton supporte l'auto-répétition lorsqu'il est maintenu enfoncé.
vi: Lùi 1 nước trong biến thể hiện tại. Nút hỗ trợ tự động lặp khi giữ.

source: <guibutton>Forward</guibutton>
fr: <guibutton>En avant</guibutton>
vi: <guibutton>Tiến</guibutton>

source: Go one move forward in the current variation. If the current position has several follow-up variations (i.e. the current node in the game tree has several child nodes), the first variation will be used. The button supports autorepeat if pressed and held.
fr: Avancer d'un coup dans la variation actuelle. Si la position actuelle a plusieurs variations de suite (c'est-à-dire que le nœud actuel dans l'arbre de jeu a plusieurs nœuds enfants), la première variation sera utilisée. Le bouton supporte l'auto-répétition lorsqu'il est maintenu enfoncé.
vi: Tiến 1 nước trong biến thể hiện tại. Nếu vị trí có nhiều biến thể tiếp theo, sẽ dùng biến thể đầu tiên. Nút hỗ trợ tự động lặp khi giữ.

source: <guibutton>Forward 10</guibutton>
fr: <guibutton>En avant de 10</guibutton>
vi: <guibutton>Tiến 10 nước</guibutton>

source: Go ten moves forward in the current variation. If a position has several follow-up variations (i.e. the current node in the game tree has several child nodes), the first variation will be used. The button supports autorepeat if pressed and held.
fr: Avancer de 10 coups dans la variation actuelle. Si une position a plusieurs variations de suite (c'est-à-dire que le nœud actuel dans l'arbre de jeu a plusieurs nœuds enfants), la première variation sera utilisée. Le bouton supporte l'auto-répétition lorsqu'il est maintenu enfoncé.
vi: Tiến 10 nước trong biến thể hiện tại. Nếu vị trí có nhiều biến thể tiếp theo, sẽ dùng biến thể đầu tiên. Nút hỗ trợ tự động lặp khi giữ.

source: <guibutton>End</guibutton>
fr: <guibutton>Fin</guibutton>
vi: <guibutton>Cuối ván</guibutton>

source: Go to the end of the current variation. Like <guibutton>Forward</guibutton>, this also uses the first variation in positions with several follow-up variations.
fr: Aller à la fin de la variation actuelle. Comme <guibutton>Avancer</guibutton>, cela utilise également la première variation dans les positions avec plusieurs variations de suite.
vi: Đến cuối biến thể hiện tại. Cũng dùng biến thể đầu tiên ở các vị trí có nhiều nhánh.

source: <guibutton>Next Variation</guibutton>
fr: <guibutton>Variation suivante</guibutton>
vi: <guibutton>Biến thể tiếp theo</guibutton>

source: Go to the next variation to the last move played (i.e. the next sibling node of the current node in the game tree).
fr: Aller à la variation suivante du dernier coup joué (c'est-à-dire au nœud frère suivant du nœud actuel dans l'arbre de jeu).
vi: Đến biến thể tiếp theo của nước đi cuối cùng (nút anh em tiếp theo trong cây ván cờ).

source: <guibutton>Previous Variation</guibutton>
fr: <guibutton>Variation précédente</guibutton>
vi: <guibutton>Biến thể trước</guibutton>

source: Go to the previous variation to the last move played (i.e. the previous sibling node of the current node in the game tree).
fr: Aller à la variation précédente du dernier coup joué (c'est-à-dire au nœud frère précédent du nœud actuel dans l'arbre de jeu).
vi: Đến biến thể trước của nước đi cuối cùng (nút anh em trước trong cây ván cờ).

source: <guimenu>Game</guimenu> Menu
fr: Menu <guimenu>Partie</guimenu>
vi: Menu <guimenu>Ván cờ</guimenu>

source: <guimenuitem>New</guimenuitem>
fr: <guimenuitem>Nouveau</guimenuitem>
vi: <guimenuitem>Ván mới</guimenuitem>

source: Start a new game.
fr: Commencer une nouvelle partie.
vi: Bắt đầu ván mới.

source: <guimenuitem>Rated Game</guimenuitem>
fr: <guimenuitem>Partie classée</guimenuitem>
vi: <guimenuitem>Ván tính elo</guimenuitem>

source: (<keysym>Ctrl+Shift+N</keysym>)
fr: (<keysym>Ctrl+Maj+N</keysym>)

source: Start a new <link linkend="rating">rated game</link> against the computer.
fr: Commencer une nouvelle <link linkend="rating">partie classée</link> contre l'ordinateur.
vi: Bắt đầu một <link linkend="rating">ván tính elo</link> với máy.

source: <guimenuitem>Game Variant</guimenuitem>
fr: <guimenuitem>Variante de jeu</guimenuitem>
vi: <guimenuitem>Biến thể trò chơi</guimenuitem>

source: Select a game variant and start a new game of this game variant.
fr: Sélectionner une variante de jeu et commencer une nouvelle partie de cette variante.
vi: Chọn một biến thể trò chơi và bắt đầu ván mới với biến thể đó.

source: <guimenuitem>Game Info</guimenuitem>
fr: <guimenuitem>Infos sur la partie</guimenuitem>
vi: <guimenuitem>Thông tin ván cờ</guimenuitem>

source: Display or edit additional information about the game like the name of the players or the date when the game was played.
fr: Afficher ou modifier des informations supplémentaires sur la partie, comme le nom des joueurs ou la date à laquelle la partie a été jouée.
vi: Hiển thị hoặc chỉnh sửa thông tin bổ sung về ván cờ như tên người chơi hoặc ngày diễn ra.

source: <guimenuitem>Undo Move</guimenuitem>
fr: <guimenuitem>Annuler le coup</guimenuitem>
vi: <guimenuitem>Hoàn tác nước đi</guimenuitem>

source: Undo the last move played and remove it from the game tree. Undoing a move is only possible if it is the last move in the current variation (i.e. a leaf node in the game tree; use <guimenu>Edit</guimenu>/<guimenuitem>Truncate</guimenuitem> to remove inner nodes of the game tree).
fr: Annuler le dernier coup joué et le supprimer de l'arbre de jeu. Annuler un coup n'est possible que s'il s'agit du dernier coup de la variation en cours (c'est-à-dire d'un nœud feuille dans l'arbre de jeu ; utilisez <guimenu>Édition</guimenu>/<guimenuitem>Couper</guimenuitem> pour supprimer les nœuds internes de l'arbre de jeu).
vi: Hoàn tác nước đi cuối cùng xóa khỏi cây ván cờ. Chỉ có thể hoàn tác nước đi cuối cùng trong biến thể hiện tại (nút lá); dùng <guimenu>Edit</guimenu> → <guimenuitem>Cắt ngắn</guimenuitem> để xóa các nút giữa.

source: <guimenuitem>Find Move</guimenuitem>
fr: <guimenuitem>Trouver un coup</guimenuitem>
vi: <guimenuitem>Tìm nước đi hợp lệ</guimenuitem>

source: Find a legal move for the current color and display it for a few seconds on the board. Selecting this item repeatedly will show all legal moves.
fr: Trouver un coup légal pour la couleur actuelle et l'afficher pendant quelques secondes sur le plateau. Sélectionner cette option plusieurs fois affichera tous les coups légaux.
vi: Tìm một nước đi hợp lệ cho màu hiện tại và hiển thị vài giây trên bảng. Chọn lặp lại sẽ hiển thị tuần tự tất cả nước hợp lệ.

source: <guimenuitem>Open</guimenuitem>
fr: <guimenuitem>Ouvrir</guimenuitem>
vi: <guimenuitem>Mở…</guimenuitem>
