Repository: enz/pentobi
Catalog: pentobi/help/po/*.po
Languages: fr, vi

source: Overview
fr: Introduction
vi: Tổng quan

source: Pentobi is a computer opponent for the board game Blokus. In this game, four players place pieces similar to the pieces of the computer game Tetris on a 20×20 board. Pentobi also supports the game variants for two or three players and the game variants Duo, Trigon, Junior, Nexos, GembloQ and Callisto.
fr: Pentobi est un adversaire informatique pour jouer à Blokus. Dans ce jeu, quatre joueurs placent des pièces similaires à celles du jeu vidéo Tetris sur un plateau de 20×20. Pentobi prend également en charge les variantes de jeu pour deux ou trois joueurs ainsi que les variantes Duo, Trigon, Junior, Nexos, GembloQ et Callisto.
vi: Pentobi là đối thủ máy tính cho trò chơi bàn cờ Blokus. Trong trò chơi này, bốn người chơi đặt các mảnh tương tự mảnh Tetris lên bảng 20×20. Pentobi cũng hỗ trợ các biến thể cho hai hoặc ba người chơi cùng các biến thể Duo, Trigon, Junior, Nexos, GembloQ và Callisto.

source: Classic Rules
fr: Règles classiques
vi: Luật Classic

source: There are four players, Blue, Yellow, Red and Green, and a board consisting of 20×20 squares. Each player has a set of 21 pieces of his color shaped like the polyominoes up to size five. A polyomino is a shape built from a number of squares connected along the edges.
fr: Il y a quatre joueurs : Bleu, Jaune, Rouge et Vert, et un plateau composé de carrés de 20×20. Chaque joueur dispose d'un ensemble de 21 pièces de sa couleur, de forme polyomino, allant jusqu'à la taille cinq. Un polyomino est une forme composée de carrés reliés par leurs bords.
vi: Có bốn người chơi: Xanh dương, Vàng, Đỏ và Xanh lá, trên bảng 20×20 ô vuông. Mỗi người chơi có bộ 21 mảnh cùng màu, hình dạng là các polyomino tối đa 5 ô. Polyomino là hình được tạo từ nhiều ô vuông nối cạnh nhau.

source: The players alternate in placing one of their pieces on the board. The first piece of a player must cover its starting square. The starting squares are located in the corners of the board.
fr: Les joueurs alternent pour placer une de leurs pièces sur le plateau. La première pièce d'un joueur doit couvrir son carré de départ. Les carrés de départ sont situés dans les coins du plateau.
vi: Các người chơi lần lượt đặt một mảnh lên bảng. Mảnh đầu tiên của mỗi người chơi phải che ô khởi đầu của mình. Các ô khởi đầu nằm ở bốn góc bảng.

source: The following pieces must be placed on empty squares such that the new piece touches at least one piece of its own color corner-to-corner but does not touch any piece of its own color along the edges. The new piece may touch edges of pieces of the opponent colors.
fr: Les pièces suivantes doivent être placées sur des cases vides de manière à ce que la nouvelle pièce touche au moins une pièce de sa propre couleur par les coins, mais ne touche aucune pièce de sa propre couleur par les bords. La nouvelle pièce peut toucher les bords des pièces des couleurs adverses.
vi: Các mảnh tiếp theo phải đặt lên ô trống, chạm góc với ít nhất một mảnh cùng màu nhưng không được chạm cạnh với mảnh cùng màu. Mảnh mới được phép chạm cạnh với mảnh màu đối thủ.

source: When the player of a color cannot place any more pieces, the player passes and the next color continues. When none of the players can place any more pieces, the player with the highest score wins. The score of a color is the number of squares on the board occupied by the color, plus a bonus of 15 points if the color could place all of its pieces, plus an additional bonus of 5 points if the color could place all pieces and the last piece played was the one-square piece.
fr: Lorsque le joueur d'une couleur ne peut plus placer de pièces, il passe son tour et la couleur suivante continue. Lorsqu'aucun joueur ne peut plus placer de pièces, le joueur avec le score le plus élevé gagne. Le score d'une couleur est le nombre de cases occupées sur le plateau par cette couleur, plus un bonus de 15 points si la couleur a pu placer toutes ses pièces, et un bonus supplémentaire de 5 points si la couleur a pu placer toutes ses pièces et que la dernière pièce jouée était la pièce de un carré.
vi: Khi một màu không còn nước đi hợp lệ thì bỏ lượt, màu tiếp theo chơi tiếp. Khi tất cả đều không còn nước đi, người có điểm cao nhất thắng. Điểm của một màu = số ô chiếm được + 15 điểm nếu đặt hết 21 mảnh + thêm 5 điểm nếu đặt hết và mảnh cuối cùng là mảnh 1 ô.

source: Rules for Two Players
fr: Règles pour deux joueurs
vi: Luật cho hai người chơi

source: The game can be played with two players. The first player plays both Blue and Red, the second player Yellow and Green. The points of both colors played by a player are added up.
fr: Le jeu peut se jouer à deux joueurs. Le premier joueur joue les couleurs Bleu et Rouge, le deuxième joueur joue Jaune et Vert. Les points des deux couleurs jouées par un joueur sont additionnés.
vi: Trò chơi có thể chơi với hai người. Người thứ nhất chơi cả Xanh dương và Đỏ, người thứ hai chơi Vàng và Xanh lá. Điểm của hai màu do một người chơi được cộng lại.

source: Rules for Three Players
fr: Règles pour trois joueurs
vi: Luật cho ba người chơi

source: The game can also be played with three players. The players take turns playing the fourth color (Green). At the end of the game, the score of Green is ignored.
fr: Le jeu peut également se jouer à trois joueurs. Les joueurs jouent à tour de rôle la quatrième couleur (Vert). À la fin de la partie, le score du Vert est ignoré.
vi: Trò chơi cũng có thể chơi với ba người. Các người chơi lần lượt chơi màu thứ tư (Xanh lá). Khi kết thúc, điểm của Xanh lá bị bỏ qua.

source: Colorless Starting Points
fr: Points de départ sans couleur
vi: Điểm khởi đầu không màu

source: Note that the original Blokus Classic rules used colorless starting points. This means that each color may freely choose, which of the remaining unoccupied starting points to use for its first move. Pentobi currently only supports the rule variant with colored starting points because this rule variant was used at the first Blokus online servers and Blokus tournaments.
fr: Notez que les règles originales de Blokus Classique utilisaient des points de départ sans couleur. Cela signifie que chaque couleur peut librement choisir lequel des points de départ non occupés utiliser pour son premier coup. Pentobi ne supporte actuellement que la variante de règle avec des points de départ colorés, car cette variante de règle a été utilisée lors des premiers serveurs en ligne Blokus et des tournois Blokus.
vi: Lưu ý luật Blokus Classic gốc dùng điểm khởi đầu không màu, mỗi màu tự chọn một trong các điểm khởi đầu còn trống cho nước đi đầu. Hiện Pentobi chỉ hỗ trợ biến thể có điểm khởi đầu cố định theo màu vì đây là luật được dùng ở các server trực tuyến và giải đấu Blokus đầu tiên.

source: Duo Rules
fr: Règles du Duo
vi: Luật Duo

source: The game variant Duo is another game variant for two players. The game is played on a smaller board with 14×14 squares. There is only one color per player (Purple and Orange) and the starting squares are not in the corners, but on the square with the coordinates (5,10) for Purple, and on (10,5) for Orange.
fr: La variante de jeu Duo est une autre variante pour deux joueurs. Le jeu se joue sur un plateau plus petit de 14×14 cases. Il n'y a qu'une seule couleur par joueur (Violet et Orange) et les cases de départ ne sont pas dans les coins, mais sur la case avec les coordonnées (5,10) pour Violet, et sur (10,5) pour Orange.
vi: Biến thể Duo dành cho hai người chơi, bảng nhỏ 14×14 ô. Mỗi người một màu duy nhất (Tím và Cam), ô khởi đầu không ở góc mà ở tọa độ (5,10) cho Tím và (10,5) cho Cam.

source: Trigon Rules
fr: Règles du Trigon
vi: Luật Trigon

source: Trigon is another game variant. The rules a similar to game variant Classic but it uses a differently shaped board and a different set of pieces. Each color uses 22 pieces that are shaped like the polyiamonds up to size six. A polyiamond is a shape built from a number of equilateral triangles connected along the edges.
fr: Trigon est une autre variante du jeu. Les règles sont similaires à celles de la variante Classique, mais il utilise un plateau de forme différente et un ensemble de pièces différent. Chaque couleur utilise 22 pièces de forme polyiamant, allant jusqu'à la taille six. Un polyiamant est une forme composée d'un certain nombre de triangles équilatéraux reliés par leurs bords.
vi: Trigon là biến thể khác, luật gần giống Classic nhưng bảng hình lục giác và dùng mảnh polyiamond (tam giác đều) tối đa 6 tam giác, mỗi màu có 22 mảnh.

source: The board also consists of triangles and is shaped like a hexagon with an edge size of nine triangles.
fr: Le plateau est également composé de triangles et a la forme d'un hexagone avec une taille de côté de neuf triangles.
vi: Bảng gồm các tam giác đều, hình lục giác với cạnh dài 9 tam giác.

source: There are six starting points on the board, each located in the middle of the fourth row away from each edge. The starting points are not colored and the players may freely choose a starting point for the first piece of a color.
fr: Il y a six points de départ sur le plateau, chacun situé au centre de la quatrième rangée, éloigné de chaque bord. Les points de départ ne sont pas colorés et les joueurs peuvent librement choisir un point de départ pour la première pièce d'une couleur.
vi: Có sáu điểm khởi đầu không màu, nằm giữa hàng thứ tư tính từ mỗi cạnh. Người chơi tự chọn điểm khởi đầu cho mảnh đầu tiên của mỗi màu.

source: Like game variant Classic, Trigon can be played with two players by having one player play Blue and Red and the other player Yellow and Green.
fr: Comme la variante de jeu Classique, Trigon peut se jouer à deux joueurs, un joueur jouant Bleu et Rouge, et l'autre joueur Jaune et Vert.
vi: Tương tự Classic, Trigon có thể chơi hai người bằng cách một người chơi Xanh dương + Đỏ, người còn lại chơi Vàng + Xanh lá.

source: Trigon can be played with three players using the same rules as for the four-player variant. The three-player variant is played on a smaller board with an edge size of eight triangles. The starting points are located in the middle of the third row away from each edge.
fr: Trigon peut se jouer à trois joueurs en utilisant les mêmes règles que pour la variante à quatre joueurs. La variante à trois joueurs se joue sur un plateau plus petit, avec une taille de côté de huit triangles. Les points de départ sont situés au centre de la troisième rangée, éloignés de chaque bord.
vi: Trigon chơi ba người dùng luật giống bốn người nhưng bảng nhỏ hơn (cạnh 8 tam giác), điểm khởi đầu nằm giữa hàng thứ ba tính từ mỗi cạnh.

source: Junior Rules
fr: Règles du Junior
vi: Luật Junior

source: Junior is a simplified game variant for two players. It is played on the same 14×14 board as game variant Duo but uses only a subset of the polyominoes up to size five and the players get two of each of those polyominoes.
fr: Junior est une variante simplifiée du jeu pour deux joueurs. Il se joue sur le même plateau de 14×14 que la variante Duo, mais utilise uniquement un sous-ensemble des polyominos jusqu'à la taille cinq, et les joueurs reçoivent deux de chaque polyomino.
vi: Junior là biến thể đơn giản cho hai người chơi, dùng bảng 14×14 như Duo nhưng chỉ dùng một phần polyomino ≤5 ô và mỗi người có hai bản sao của mỗi mảnh.

source: Bonus points are not used in Junior.
fr: Les points bonus ne sont pas utilisés dans Junior.
vi: Junior không dùng điểm thưởng.

source: Nexos Rules
fr: Règles du Nexos
vi: Luật Nexos

source: Nexos is a board game similar to Blokus. The board is a rectangular 13×13 line grid. Each color uses 24 pieces that consist of up to four connected line segments.
fr: Nexos est un jeu de société similaire à Blokus. Le plateau est une grille rectangulaire de 13×13 cases. Chaque couleur utilise 24 pièces composées de jusqu'à quatre segments de ligne connectés.
vi: Nexos là trò chơi tương tự Blokus. Bảng là lưới đường 13×13. Mỗi màu có 24 mảnh gồm tối đa 4 đoạn đường nối nhau.

source: Each color has a starting intersection on the intersection of the third lines close to a corner. The first piece must touch the starting intersection.
fr: Chaque couleur a un point de départ à l'intersection des troisième lignes près d'un coin. La première pièce doit toucher le point de départ.
vi: Mỗi màu có giao điểm khởi đầu nằm tại giao của đường thứ ba gần góc. Mảnh đầu tiên phải chạm giao điểm khởi đầu đó.

source: The following pieces must be placed on empty line segments such that a segment of the new piece touches an intersection that is already touched by a segment of the same color. It does not matter if pieces of other colors touch or cover the same intersection. However, pieces may not overlap. The junctions between the segments within a piece are such that two rectangular junctions of different pieces can cover the same intersection without overlapping, but straight junctions cannot.
fr: Les pièces suivantes doivent être placées sur des segments de ligne vides de manière à ce qu'un segment de la nouvelle pièce touche une intersection déjà touchée par un segment de la même couleur. Peu importe si des pièces d'autres couleurs touchent ou couvrent la même intersection. Cependant, les pièces ne doivent pas se chevaucher. Les jonctions entre les segments d'une pièce sont telles que deux jonctions rectangulaires de pièces différentes peuvent couvrir la même intersection sans se chevaucher, mais les jonctions droites ne peuvent pas.
vi: Các mảnh sau phải đặt lên đoạn đường trống sao cho ít nhất một đoạn của mảnh mới chạm giao điểm đã được mảnh cùng màu chạm. Mảnh các màu khác có thể cùng chạm một giao điểm. Mảnh không được chồng lên nhau. Hai mối nối vuông góc của hai mảnh khác nhau có thể cùng chiếm một giao điểm mà không chồng, nhưng mối nối thẳng thì không.

source: The score of a color is the number of line segments on the board covered by the color, plus a bonus of 10 points if the color could place all of its pieces.
fr: Le score d'une couleur est le nombre de segments de ligne sur le plateau couverts par cette couleur, plus un bonus de 10 points si la couleur a pu placer toutes ses pièces.
vi: Điểm của một màu = số đoạn đường bị chiếm + 10 điểm nếu đặt hết 24 mảnh.

source: Like Blokus, Nexos can be played with two players by having one player play Blue and Red and the other player Yellow and Green.
fr: Comme Blokus, Nexos peut se jouer à deux joueurs, un joueur jouant Bleu et Rouge, et l'autre joueur Jaune et Vert.
vi: Tương tự Blokus, Nexos có thể chơi hai người bằng cách một người chơi Xanh dương + Đỏ, người kia chơi Vàng + Xanh lá.

source: GembloQ Rules
fr: Règles du GembloQ
vi: Luật GembloQ

source: GembloQ is a board game similar to Blokus. The squares of the board are rotated by 45 degrees. The board has a diagonal size of 27 squares. In addition to the full squares, the edges also contain half squares such that the edges are straight lines.
fr: GembloQ est un jeu de société similaire à Blokus. Les cases du plateau sont tournées de 45 degrés. Le plateau a une taille diagonale de 27 cases. En plus des cases entières, les bords contiennent également des demi-cases de sorte que les bords forment des lignes droites.
vi: GembloQ tương tự Blokus nhưng ô vuông xoay 45°. Bảng có đường chéo 27 ô, các cạnh chứa nửa ô để tạo biên thẳng.

source: Each player has a set of 21 pieces, which include a subset of the pieces used in Blokus, but also some pieces that contain a half square.
fr: Chaque joueur dispose d'un ensemble de 21 pièces, comprenant un sous-ensemble des pièces utilisées dans Blokus, mais également certaines pièces contenant une demi-case.
vi: Mỗi người chơi có 21 mảnh, gồm một phần mảnh Blokus và một số mảnh chứa nửa ô.

source: As in Blokus, the starting squares are in the corners, the first move must fully cover the starting square of the color and subsequent moves must touch a piece of the player color at a vertex, but not edge-to-edge. Moves are also legal, if a vertex of a half square touches an edge of a piece of the same color.
fr: Comme dans Blokus, les cases de départ sont dans les coins, le premier coup doit couvrir complètement la case de départ de la couleur et les coups suivants doivent toucher une pièce de la couleur du joueur par un sommet, mais pas bord à bord. Les coups sont également légaux si un sommet d'une demi-case touche un bord d'une pièce de la même couleur.
vi: Như Blokus, ô khởi đầu ở góc, nước đầu phải che kín ô đó. Các nước sau phải chạm đỉnh (không chạm cạnh) với mảnh cùng màu. Nước đi cũng hợp lệ nếu đỉnh của nửa ô chạm cạnh mảnh cùng màu.

source: Scoring is done like in Blokus, half squares count 0.5 points. Bonus points are not used. Tie breaking by assigning additional values to the pieces, as described in the official GembloQ rules, is currently not supported by Pentobi.
fr: Le score est calculé comme dans Blokus, les demi-cases comptent 0,5 point. Les points bonus ne sont pas utilisés. Le départage par l'attribution de valeurs supplémentaires aux pièces, comme décrit dans les règles officielles de GembloQ, n'est actuellement pas pris en charge par Pentobi.
vi: Tính điểm giống Blokus, nửa ô tính 0.5 điểm. Không dùng điểm thưởng. Pentobi hiện không hỗ trợ cách phá hòa theo giá trị mảnh của luật GembloQ chính thức.

source: Rules for Two and Three Players
fr: Règles pour deux et trois joueurs
vi: Luật cho hai và ba người chơi

source: The game variants for two and three players use smaller boards and different starting point locations. In addition to the standard two-player variant, Pentobi also supports a game variant for two players like in Blokus, in which each player plays two colors.
fr: Les variantes de jeu pour deux et trois joueurs utilisent des plateaux plus petits et des emplacements de points de départ différents. En plus de la variante standard pour deux joueurs, Pentobi prend également en charge une variante de jeu pour deux joueurs comme dans Blokus, où chaque joueur joue deux couleurs.
vi: Các biến thể hai và ba người dùng bảng nhỏ hơn và vị trí khởi đầu khác. Ngoài biến thể hai người tiêu chuẩn, Pentobi còn hỗ trợ kiểu hai người giống Blokus (mỗi người chơi hai màu).

source: Callisto Rules
fr: Règles du Callisto
vi: Luật Callisto

source: Callisto is a another board game similar to Blokus. The board is derived from the classic 20×20 Blokus board by removing the corners such that an octagon with a top edge of size six remains. The pieces are a subset of the polyominoes up to size five. They include three 1×1 pieces per player that play a special role.
fr: Callisto est un autre jeu de société similaire à Blokus. Le plateau est dérivé du plateau classique de 20×20 de Blokus en supprimant les coins, de sorte qu'il reste un octogone avec un côté supérieur de taille six. Les pièces sont un sous-ensemble des polyominos jusqu'à la taille cinq. Elles incluent trois pièces de 1×1 par joueur qui jouent un rôle spécial.
vi: Callisto là trò chơi tương tự Blokus. Bảng lấy từ bảng Blokus 20×20 nhưng cắt góc để còn bát giác với cạnh trên dài 6 ô. Mảnh là tập con của polyomino ≤5 ô, mỗi người có thêm ba mảnh 1×1 có vai trò đặc biệt.

source: The 1×1 pieces may be placed anywhere on the board apart from the center of the board. The center consists of an octagon with width six and top edge size two. The first two moves of a player must use a 1×1 piece, the third 1×1 piece may be played anytime later.
fr: Les pièces de 1×1 peuvent être placées n'importe où sur le plateau, à l'exception du centre du plateau. Le centre est constitué d'un octogone de largeur six et de côté supérieur de taille deux. Les deux premiers coups d'un joueur doivent utiliser une pièce de 1×1, la troisième pièce de 1×1 peut être jouée à tout moment par la suite.
vi: Mảnh 1×1 được đặt bất kỳ đâu trừ vùng trung tâm (bát giác rộng 6, cạnh trên dài 2). Hai nước đầu của mỗi màu phải dùng mảnh 1×1, mảnh 1×1 thứ ba có thể dùng bất kỳ lúc nào.

source: All larger pieces may be placed anywhere on the board but must touch an existing piece of the same color edge-to-edge.
fr: Toutes les pièces plus grandes peuvent être placées n'importe où sur le plateau, mais doivent toucher une pièce existante de la même couleur bord à bord.
vi: Các mảnh lớn hơn được đặt bất kỳ đâu nhưng phải chạm cạnh với mảnh cùng màu đã có.

source: The score of a color is the number of squares on the board occupied by the color not counting 1×1 pieces. Bonus points are not used. Unlike in Blokus, ties are broken in favor of the player who started later.
fr: Le score d'une couleur est le nombre de cases sur le plateau occupées par cette couleur, sans compter les pièces de 1×1. Les points bonus ne sont pas utilisés. Contrairement à Blokus, en cas d'égalité, le départage est en faveur du joueur qui a commencé plus tard.
vi: Điểm của một màu = số ô chiếm được (không tính mảnh 1×1). Không dùng điểm thưởng. Phá hòa ưu tiên người đi sau.

source: The game can be played with less than four players by using a smaller board. For three players, the board is an octagon with width 20 and top edge size two. For two players, the board is an octagon with width 16 and top edge size two. The size of the center stays the same. In addition to the standard two-player variant, Pentobi also supports a game variant for two players like in Blokus, in which each player plays two colors.
fr: Le jeu peut se jouer avec moins de quatre joueurs en utilisant un plateau plus petit. Pour trois joueurs, le plateau est un octogone de largeur 20 et de côté supérieur de taille deux. Pour deux joueurs, le plateau est un octogone de largeur 16 et de côté supérieur de taille deux. La taille du centre reste inchangée. En plus de la variante standard pour deux joueurs, Pentobi prend également en charge une variante de jeu pour deux joueurs comme dans Blokus, où chaque joueur joue deux couleurs.
vi: Chơi dưới bốn người thì dùng bảng nhỏ hơn. Ba người: bát giác rộng 20, cạnh trên 2. Hai người: bát giác rộng 16, cạnh trên 2. Vùng trung tâm giữ nguyên kích thước. Ngoài biến thể hai người tiêu chuẩn, Pentobi còn hỗ trợ kiểu hai người giống Blokus (mỗi người chơi hai màu).

source: How to Use Pentobi
fr: Comment utiliser Pentobi
vi: Cách sử dụng Pentobi

source: Board
fr: Plateau
vi: Bảng chơi

source: Pieces can be selected by clicking on one of the unplayed pieces or by using <link linkend="shortcuts">shortcut keys</link>. Pieces can be played by dragging them to a place that corresponds to a legal move with the mouse or arrow keys and pressing the left mouse button or the Enter key.
fr: Les pièces peuvent être sélectionnées en cliquant sur l'une des pièces non jouées ou en utilisant les <link linkend="shortcuts">touches de raccourci</link>. Les pièces peuvent être jouées en les faisant glisser à un emplacement correspondant à un coup légal avec la souris ou les touches fléchées, puis en appuyant sur le bouton gauche de la souris ou la touche Entrée.
vi: Chọn mảnh bằng cách nhấp vào mảnh chưa chơi hoặc dùng <link linkend="shortcuts">phím tắt</link>. Đặt mảnh bằng cách kéo thả hoặc dùng phím mũi tên đến vị trí hợp lệ rồi nhấn chuột trái hoặc Enter.

source: Played pieces on the board can have numbers on them that indicate the move number in which the piece was played. A letter after the move number indicates that there exists a variation to this move (see below).
fr: Les pièces jouées sur le plateau peuvent avoir des numéros indiquant le numéro du coup dans lequel la pièce a été jouée. Une lettre après le numéro du coup indique qu'il existe une variation pour ce coup (voir ci-dessous).
vi: Các mảnh đã đặt trên bảng có thể hiển thị số thứ tự nước đi. Chữ cái sau số nước đi cho biết tồn tại một biến thể tại nước đó (xem bên dưới).
